#include <stdio.h> // Укључујемо стандардну библиотеку за улаз/излаз

// Почетак главне функције
int main()
{
    while (1) // Бесконачна петља
    {
        int i, n;            // Декларација целих бројева 'i' и 'n'
        long faktorijel = 1; // Декларација и иницијализација променљиве 'faktorijel' на 1

        printf("\n--------------------\n");

        // Исписујемо поруку кориснику да унесе број
        printf("\nn= ");
        // Узимамо унос од корисника и чувамо га у променљивој 'n'
        scanf("%d", &n);

        // Петља која иде од 1 до 'n' (укључујући 'n')
        // Пример: 5! = 5 * 4 * 3 * 2 * 1 = 120
        for (i = 1; i <= n; i++)
        {
            // Множимо тренутни факторијел са 'i'
            faktorijel = faktorijel * i;
        }

        // Исписујемо резултат, тј. факторијел броја 'n'
        printf("Факторијел = %ld\n", faktorijel);
        printf("\n--------------------\n");
    }

    // Враћање 0 се неће достигнути због бесконачне петље
    return 0; // Ова линија неће бити достигнута
}
