#include <stdio.h>
#define MAX 100 // Дефинишемо MAX као 100, што је максимални број елемената у низу

int main()
{
    int niz[MAX]; // Декларишемо низ који ће садржати елементе
    int i, n;     // Декларишемо променљиве за индексе и број елемената у низу

    // Исписујемо поруку за унос броја елемената
    printf(" n = ");
    // Учитајте број елемената које корисник жели да унесе
    scanf("%d", &n);

    // Исписујемо поруку за унос елемената низа
    printf(" Unesite %d elemenata:", n);
    // Петља која ће учитати елементе у низ
    for (i = 0; i < n; i++)
        scanf("%d", &niz[i]); // Учитава елемент у низ

    // Исписујемо "Obrnuto: ", што означава да ће следити елементи низа у обрнутом редоследу
    printf("\n Obrnuto: ");
    // Петља која пролази кроз елементе низа од последњег до првог
    for (i = n - 1; i >= 0; i--)
        printf(" %d", niz[i]); // Исписује сваки елемент у обрнутом редоследу

    getchar(); // Чекамо да корисник притисне било који тастер пре него што програм заврши
    return 0;  // Завршавамо програм
}
