#include <stdio.h>
#include <stdlib.h>

int main()
{
    // Правимо показиваче (поинтере) који ће чувати адресе наших бројева
    int *p1, *p2;

    // Резервишемо меморију за први број
    // malloc прави "кутију" у меморији величине једног целог броја
    p1 = (int *)malloc(sizeof(int));
    if (p1 == NULL) // Проверавамо да ли је успело прављење "кутије"
    {
        printf("Грешка!");
        return 1;
    }
    // Исто радимо и за други број
    p2 = (int *)malloc(sizeof(int));
    if (p2 == NULL)
    {
        printf("Грешка!");
        return 1;
    }

    // Тражимо од корисника да унесе два броја
    printf("\n Унесите два цела броја: \n");
    scanf("%d", p1); // Први број се смешта на адресу p1
    scanf("%d", p2); // Други број се смешта на адресу p2

    // Штампамо резултат сабирања
    // *p1 и *p2 нам дају вредности које се налазе на тим адресама
    printf("\n %d + %d = %d\n", *p1, *p2, *p1 + *p2);

    // Ослобађамо меморију коју смо резервисали
    // Као да враћамо "кутије" које смо позајмили
    free(p1);
    free(p2);

    getchar();
    return 0;
}