#include <stdio.h>

int main()
{
    // н је величина квадрата (нпр. ако је н=5, добијамо квадрат 5x5)
    int n, i, j;
    printf(" n = ");
    scanf("%d", &n);

    // Цртање горње ивице квадрата
    printf("+");
    // и < н - 2 јер први и задњи карактер су '+',
    // па нам треба н-2 цртица '-' између њих
    for (i = 0; i < n - 2; i++)
    {
        printf("-");
    }
    printf("+\n");

    /*

    j=0   j=1  j=2  j=3  j=4
    i=0    +    -    -    -    +
    i=1    |    \    X    /    |
    i=2    |    /    \    \    |
    i=3    +    -    -    -    +

    */

    // Петља и иде од 1 до н-2 јер прву и задњу линију већ имамо (оне са +)
    for (i = 1; i < n - 1; i++)
    {
        printf("|"); // Лева ивица
        for (j = 1; j < n - 1; j++)
        {
            // н/2 је центар квадрата (и по вертикали и хоризонтали)
            if (i == n / 2 && j == n / 2)
            {
                printf("X"); // Цртање X у центру квадрата
            }
            // када су и и ј једнаки, то значи да смо на главној дијагонали (\)
            else if (i == j)
            {
                printf("\\"); // Цртање дијагонале '\'
            }
            // формула н-1-ј даје нам споредну дијагоналу (/)
            else if (i == n - 1 - j)
            {
                printf("/"); // Цртање дијагонале '/'
            }
            else
            {
                printf(" "); // Празна места
            }
        }
        printf("|\n"); // Десна ивица
    }

    // Цртање доње ивице квадрата
    printf("+");
    for (i = 0; i < n - 2; i++)
    {
        printf("-");
    }
    printf("+\n");

    getchar();
    return 0;
}