#include <stdio.h> // Ово нам омогућава да користимо функције за унос и износ података

int main() // Овде почиње наш главни програм
{
    int i = 3, n, fpp = 1, fp = 1, fn; // Декларишемо променљиве:
                                       // i - почињемо од 3, јер смо већ исписали прва два
                                       // n - број који уносимо
                                       // fpp - први претходни број Фибоначијеве серије
                                       // fp - други претходни број Фибоначијеве серије
                                       // fn - нови Фибоначијев број

    printf(" n = ");                // Питамо корисника да унесе број
    scanf("%d", &n);                // Узимамо број који је корисник унео
    printf("\n f1 = 1\n f2 = 1\n"); // Исписујемо прва два Фибоначијева броја

    // Овде почињемо циклус који ће се извршавати све док је i мање или једнако n
    while (i <= n)
    {
        fn = fp + fpp;               // Израчунавамо нови Фибоначијев број
        fpp = fp;                    // Померамо првог претходног броја на позицију другог
        fp = fn;                     // Померамо другог претходног броја на позицију новог
        printf(" f%d= %d\n", i, fn); // Исписујемо нови Фибоначијев број
        i++;                         // Повећавамо i за 1
    }

    return 0; // Завршавамо програм
}

/*

Пример
Ако имамо:

fp = 2 (последњи број)
fpp = 1 (претходни број)
Код ради:

fn = 2 + 1 → fn = 3 (нови број)
fpp = 2 (сada је fpp 2)
fp = 3 (сada је fp 3)
Тако, следећи пут ћемо имати:

fp = 3
fpp = 2

*/